var labels = ['2022-06-19','2022-06-20','2022-06-21','2022-06-22','2022-06-23','2022-06-24','2022-06-25',];var datasets = [
  {
    "label": "まめきちまめこニートの日常",
    "data": [
      1,
      1,
      1,
      1,
      2,
      1,
      1
    ]
  },
  {
    "label": "オレ的ゲーム速報＠刃",
    "data": [
      2,
      2,
      3,
      3,
      1,
      2,
      2
    ]
  },
  {
    "label": "不思議.net",
    "data": [
      3,
      3,
      4,
      2,
      3,
      3,
      4
    ]
  },
  {
    "label": "痛いニュース(ﾉ∀`)",
    "data": [
      4,
      4,
      5,
      4,
      6,
      7,
      3
    ]
  },
  {
    "label": "はちま起稿",
    "data": [
      5,
      5,
      6,
      5,
      4,
      5,
      5
    ]
  },
  {
    "label": "暇つぶしニュース",
    "data": [
      6,
      6,
      7,
      6,
      7,
      8,
      7
    ]
  },
  {
    "label": "なんじぇいスタジアム＠なんJまとめ",
    "data": [
      7,
      7,
      8,
      8,
      8,
      4,
      6
    ]
  },
  {
    "label": "NEWSまとめもりー｜2chまとめブログ",
    "data": [
      8,
      10,
      11,
      10,
      9,
      9,
      9
    ]
  },
  {
    "label": "【2ch】ニュー速クオリティ",
    "data": [
      9,
      8,
      10,
      9,
      10,
      10,
      10
    ]
  },
  {
    "label": "ハムスター速報",
    "data": [
      10,
      9,
      9,
      7,
      5,
      6,
      8
    ]
  },
  {
    "label": "カラパイア",
    "data": [
      11,
      12,
      17,
      19,
      16,
      21,
      22
    ]
  },
  {
    "label": "わんこーる速報！",
    "data": [
      12,
      13,
      13,
      11,
      11,
      11,
      11
    ]
  },
  {
    "label": "ヤゴヴのマンガ劇場",
    "data": [
      13,
      15,
      18,
      24,
      22,
      18,
      16
    ]
  },
  {
    "label": "哲学ニュースnwk",
    "data": [
      14,
      11,
      12,
      12,
      12,
      14,
      13
    ]
  },
  {
    "label": "BIPブログ",
    "data": [
      15,
      14,
      21,
      13,
      13,
      13,
      14
    ]
  },
  {
    "label": "おうまがタイムズ",
    "data": [
      16,
      16,
      15,
      14,
      15,
      16,
      17
    ]
  },
  {
    "label": "NEWSぽけまとめーる",
    "data": [
      17,
      17,
      16,
      16,
      14,
      19,
      18
    ]
  },
  {
    "label": "なんJ PRIDE",
    "data": [
      18,
      18,
      19,
      22,
      17,
      15,
      15
    ]
  },
  {
    "label": "カエルDXのオタ活日記",
    "data": [
      19,
      19,
      24,
      20,
      21,
      22,
      25
    ]
  },
  {
    "label": "なんJクエスト",
    "data": [
      20,
      23,
      27,
      26,
      28,
      28,
      26
    ]
  },
  {
    "label": "VIPPERな俺",
    "data": [
      21,
      29,
      28,
      28,
      26,
      25,
      29
    ]
  },
  {
    "label": "ねいろ速報さん",
    "data": [
      22,
      22,
      14,
      17,
      19,
      17,
      21
    ]
  },
  {
    "label": "ぶる速-VIP",
    "data": [
      23,
      20,
      23,
      25,
      25,
      26,
      20
    ]
  },
  {
    "label": "稲妻速報",
    "data": [
      24,
      21,
      22,
      21,
      23,
      24,
      23
    ]
  },
  {
    "label": "日刊やきう速報",
    "data": [
      25,
      27,
      30,
      29,
      18,
      23,
      19
    ]
  },
  {
    "label": "ラビット速報",
    "data": [
      26,
      26,
      26,
      27,
      27,
      27,
      27
    ]
  },
  {
    "label": "うしみつ-5chまとめ-",
    "data": [
      27,
      28,
      35,
      32,
      31,
      33,
      37
    ]
  },
  {
    "label": "しばたまブログ",
    "data": [
      28,
      31,
      101,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "ゴールデンタイムズ",
    "data": [
      29,
      24,
      25,
      23,
      24,
      20,
      24
    ]
  },
  {
    "label": "まとめたニュース",
    "data": [
      30,
      38,
      36,
      35,
      30,
      37,
      35
    ]
  },
  {
    "label": "あいチャンネル",
    "data": [
      31,
      39,
      34,
      31,
      59,
      34,
      38
    ]
  },
  {
    "label": "カイカイ反応通信",
    "data": [
      32,
      35,
      31,
      30,
      29,
      29,
      32
    ]
  },
  {
    "label": "ふくよかまるみのピリカラ人生",
    "data": [
      33,
      36,
      29,
      33,
      32,
      32,
      28
    ]
  },
  {
    "label": "IT速報",
    "data": [
      34,
      30,
      33,
      47,
      35,
      43,
      39
    ]
  },
  {
    "label": "スカッと連載ブログ（スカログ）",
    "data": [
      35,
      34,
      38,
      45,
      51,
      72,
      59
    ]
  },
  {
    "label": "ガールズVIPまとめ",
    "data": [
      36,
      37,
      37,
      46,
      55,
      42,
      43
    ]
  },
  {
    "label": "ネギ速",
    "data": [
      37,
      33,
      32,
      38,
      45,
      45,
      42
    ]
  },
  {
    "label": "ニュースBUZZ",
    "data": [
      38,
      41,
      46,
      34,
      39,
      36,
      36
    ]
  },
  {
    "label": "され妻つきこブログ｜アラサーママのサレ妻経験録",
    "data": [
      39,
      48,
      57,
      82,
      99,
      101,
      64
    ]
  },
  {
    "label": "ぱんをたずねて2000里ちょい",
    "data": [
      40,
      25,
      20,
      15,
      20,
      12,
      12
    ]
  },
  {
    "label": "web漫画家やしろあずきの日常",
    "data": [
      41,
      57,
      67,
      79,
      68,
      64,
      81
    ]
  },
  {
    "label": "ポリー速報",
    "data": [
      42,
      46,
      54,
      59,
      57,
      48,
      50
    ]
  },
  {
    "label": "オタクニュース",
    "data": [
      43,
      44,
      52,
      42,
      47,
      65,
      68
    ]
  },
  {
    "label": "気になる芸能まとめ",
    "data": [
      44,
      47,
      47,
      48,
      43,
      53,
      53
    ]
  },
  {
    "label": "チリツモブログ",
    "data": [
      45,
      101,
      55,
      101,
      101,
      101,
      51
    ]
  },
  {
    "label": "【2ch】コピペ情報局",
    "data": [
      46,
      42,
      41,
      39,
      42,
      39,
      40
    ]
  },
  {
    "label": "乃木坂46まとめ 1/46",
    "data": [
      47,
      43,
      48,
      52,
      53,
      54,
      33
    ]
  },
  {
    "label": "オタク.com －オタコム－",
    "data": [
      48,
      54,
      44,
      44,
      44,
      47,
      47
    ]
  },
  {
    "label": "ガハろぐNewsヽ(･ω･)/ｽﾞｺｰ",
    "data": [
      49,
      53,
      39,
      37,
      38,
      40,
      45
    ]
  },
  {
    "label": "VIP NEWS",
    "data": [
      50,
      76,
      89,
      67,
      52,
      71,
      48
    ]
  },
  {
    "label": "おーるじゃんる",
    "data": [
      51,
      45,
      43,
      40,
      37,
      44,
      46
    ]
  },
  {
    "label": "マンガと私と猫ブログ。",
    "data": [
      52,
      40,
      51,
      36,
      46,
      38,
      44
    ]
  },
  {
    "label": "人間まおと愉快な仲間たち",
    "data": [
      53,
      50,
      45,
      43,
      33,
      30,
      31
    ]
  },
  {
    "label": "ライフハックちゃんねる弐式",
    "data": [
      54,
      56,
      50,
      54,
      62,
      59,
      63
    ]
  },
  {
    "label": "芸能人の気になる噂",
    "data": [
      55,
      58,
      60,
      62,
      63,
      57,
      62
    ]
  },
  {
    "label": "あにこ便",
    "data": [
      56,
      60,
      59,
      63,
      69,
      75,
      70
    ]
  },
  {
    "label": "MLB NEWS@まとめ",
    "data": [
      57,
      66,
      72,
      77,
      78,
      61,
      65
    ]
  },
  {
    "label": "海外の万国反応記＠海外の反応",
    "data": [
      58,
      62,
      56,
      53,
      58,
      51,
      55
    ]
  },
  {
    "label": "カオスちゃんねる",
    "data": [
      59,
      51,
      42,
      50,
      54,
      49,
      49
    ]
  },
  {
    "label": "なんJ（まとめては）いかんのか？",
    "data": [
      60,
      75,
      101,
      71,
      48,
      50,
      61
    ]
  },
  {
    "label": "ゆっぺのゆる漫画ブログ",
    "data": [
      61,
      101,
      40,
      41,
      34,
      31,
      34
    ]
  },
  {
    "label": "ダイエット速報＠2ちゃんねる",
    "data": [
      62,
      81,
      94,
      61,
      60,
      94,
      90
    ]
  },
  {
    "label": "Jの番記者",
    "data": [
      63,
      101,
      101,
      101,
      40,
      56,
      101
    ]
  },
  {
    "label": "ふぇー速",
    "data": [
      64,
      69,
      65,
      92,
      101,
      86,
      101
    ]
  },
  {
    "label": "軍事・ミリタリー速報☆彡",
    "data": [
      65,
      63,
      62,
      80,
      75,
      69,
      67
    ]
  },
  {
    "label": "ツバメ速報＠ヤクルトスワローズまとめ",
    "data": [
      66,
      59,
      53,
      58,
      64,
      66,
      57
    ]
  },
  {
    "label": "2chコピペ保存道場",
    "data": [
      67,
      68,
      75,
      75,
      79,
      78,
      75
    ]
  },
  {
    "label": "サカラボ | サッカーまとめ速報",
    "data": [
      68,
      52,
      63,
      66,
      50,
      55,
      52
    ]
  },
  {
    "label": "ついんてーる速報",
    "data": [
      69,
      74,
      71,
      78,
      74,
      85,
      76
    ]
  },
  {
    "label": "thunthunのドタバタ起笑転結",
    "data": [
      70,
      78,
      69,
      93,
      41,
      70,
      79
    ]
  },
  {
    "label": "コミックエッセイ えむふじんがあらわれた",
    "data": [
      71,
      61,
      49,
      49,
      36,
      41,
      41
    ]
  },
  {
    "label": "スターライト速報 -遊戯王OCG情報まとめ-",
    "data": [
      72,
      70,
      74,
      65,
      71,
      68,
      71
    ]
  },
  {
    "label": "流速VIP",
    "data": [
      73,
      67,
      70,
      74,
      86,
      60,
      69
    ]
  },
  {
    "label": "エクサワロス",
    "data": [
      74,
      64,
      58,
      56,
      56,
      58,
      58
    ]
  },
  {
    "label": "えみコミック！",
    "data": [
      75,
      49,
      64,
      51,
      90,
      46,
      54
    ]
  },
  {
    "label": "ずっと日曜日のターン",
    "data": [
      76,
      55,
      97,
      55,
      95,
      83,
      89
    ]
  },
  {
    "label": "凹凸ちゃんねる　発達障害・生きにくい人のまとめ",
    "data": [
      77,
      85,
      86,
      86,
      66,
      63,
      74
    ]
  },
  {
    "label": "TweetPocket | Twitterまとめ",
    "data": [
      78,
      101,
      101,
      101,
      83,
      101,
      101
    ]
  },
  {
    "label": "かぞくちゃんねる",
    "data": [
      79,
      89,
      87,
      68,
      76,
      91,
      88
    ]
  },
  {
    "label": "はーとログ",
    "data": [
      80,
      84,
      80,
      88,
      72,
      76,
      85
    ]
  },
  {
    "label": "基地沢直樹-復讐・修羅場・DQN返し【2chスカッとする話まとめ】",
    "data": [
      81,
      97,
      81,
      91,
      84,
      101,
      101
    ]
  },
  {
    "label": "野球お絵かきまとめ@なんJ",
    "data": [
      82,
      72,
      101,
      101,
      101,
      90,
      101
    ]
  },
  {
    "label": "鬼女まとめログ｜生活2chまとめブログ",
    "data": [
      83,
      96,
      101,
      101,
      92,
      73,
      72
    ]
  },
  {
    "label": "なんJ　高校野球まとめ速報",
    "data": [
      84,
      83,
      90,
      87,
      70,
      74,
      80
    ]
  },
  {
    "label": "馬鳥速報",
    "data": [
      85,
      87,
      66,
      70,
      80,
      79,
      78
    ]
  },
  {
    "label": "新・規格外でもいいじゃない!!～シングルマザーたまことゆかいな子ども達～",
    "data": [
      86,
      101,
      101,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "アニはつ -アニメ発信場-",
    "data": [
      87,
      91,
      76,
      73,
      89,
      80,
      82
    ]
  },
  {
    "label": "お料理速報",
    "data": [
      88,
      71,
      95,
      97,
      87,
      95,
      97
    ]
  },
  {
    "label": "投資ちゃんねる",
    "data": [
      89,
      101,
      85,
      94,
      88,
      92,
      101
    ]
  },
  {
    "label": "修羅場ハザード -復讐・DQN返し・衝撃系まとめ-",
    "data": [
      90,
      82,
      68,
      69,
      73,
      89,
      84
    ]
  },
  {
    "label": "鷹速@ホークスまとめブログ",
    "data": [
      91,
      95,
      77,
      84,
      94,
      77,
      86
    ]
  },
  {
    "label": "PS5速報！",
    "data": [
      92,
      101,
      100,
      57,
      65,
      62,
      60
    ]
  },
  {
    "label": "ろぼ速VIP",
    "data": [
      93,
      86,
      91,
      98,
      100,
      101,
      101
    ]
  },
  {
    "label": "絵日記でございます。",
    "data": [
      94,
      101,
      101,
      101,
      67,
      101,
      101
    ]
  },
  {
    "label": "footballnet【サッカー5chまとめ】",
    "data": [
      95,
      101,
      101,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "De速",
    "data": [
      96,
      65,
      61,
      64,
      61,
      52,
      56
    ]
  },
  {
    "label": "スズぺぺの人生何とかなってます!!",
    "data": [
      97,
      101,
      101,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "カータンBLOG　あたし・主婦の頭の中",
    "data": [
      98,
      98,
      83,
      101,
      101,
      84,
      92
    ]
  },
  {
    "label": "にいがた通信 - 新潟県新潟市の地域情報サイト",
    "data": [
      99,
      101,
      101,
      101,
      101,
      101,
      100
    ]
  },
  {
    "label": "最強ジャンプ放送局",
    "data": [
      100,
      93,
      79,
      95,
      81,
      93,
      93
    ]
  },
  {
    "label": "曽山一寿のそやまんがぶろぐ",
    "data": [
      101,
      32,
      101,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "働く大人の非常識",
    "data": [
      101,
      73,
      88,
      72,
      101,
      101,
      94
    ]
  },
  {
    "label": "ろくのコミックブログ",
    "data": [
      101,
      77,
      101,
      90,
      101,
      67,
      101
    ]
  },
  {
    "label": "やみ速@なんJ西武まとめ",
    "data": [
      101,
      79,
      92,
      101,
      101,
      101,
      73
    ]
  },
  {
    "label": "ツイッター速報",
    "data": [
      101,
      80,
      2,
      18,
      49,
      101,
      95
    ]
  },
  {
    "label": "おにひめちゃんの監視部屋-鬼女、キチママ、修羅場、生活まとめ-",
    "data": [
      101,
      88,
      101,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "いきぬき2ちゃんねる",
    "data": [
      101,
      90,
      78,
      76,
      101,
      81,
      101
    ]
  },
  {
    "label": "スズぺぺの人生何とかなってます!!",
    "data": [
      101,
      92,
      98,
      83,
      77,
      96,
      87
    ]
  },
  {
    "label": "コノユビ",
    "data": [
      101,
      94,
      101,
      101,
      101,
      100,
      101
    ]
  },
  {
    "label": "今日速2ch",
    "data": [
      101,
      99,
      82,
      101,
      101,
      101,
      77
    ]
  },
  {
    "label": "FF14速報",
    "data": [
      101,
      100,
      84,
      85,
      82,
      82,
      83
    ]
  },
  {
    "label": "五箇野人の海外旅日記",
    "data": [
      101,
      101,
      73,
      101,
      101,
      101,
      101
    ]
  },
  {
    "label": "鈴木さん速報",
    "data": [
      101,
      101,
      93,
      101,
      91,
      87,
      91
    ]
  },
  {
    "label": "つつみのブログ",
    "data": [
      101,
      101,
      96,
      101,
      96,
      101,
      96
    ]
  },
  {
    "label": "大艦巨砲主義！",
    "data": [
      101,
      101,
      99,
      89,
      101,
      101,
      101
    ]
  },
  {
    "label": "世にも奇妙ななんかの話",
    "data": [
      101,
      101,
      101,
      60,
      101,
      35,
      30
    ]
  },
  {
    "label": "※非公式 刀剣乱舞(とうらぶ)攻略速報",
    "data": [
      101,
      101,
      101,
      81,
      85,
      101,
      101
    ]
  },
  {
    "label": "怒り新党～仕返し・復讐・修羅場まとめ～",
    "data": [
      101,
      101,
      101,
      96,
      93,
      99,
      98
    ]
  },
  {
    "label": "つんの日常ブログ",
    "data": [
      101,
      101,
      101,
      99,
      97,
      97,
      101
    ]
  },
  {
    "label": "もっちのママ友トラブル・子育て漫画",
    "data": [
      101,
      101,
      101,
      100,
      101,
      101,
      101
    ]
  },
  {
    "label": "もちログ",
    "data": [
      101,
      101,
      101,
      101,
      98,
      98,
      66
    ]
  },
  {
    "label": "GIANTS PRIDE -巨人なんJまとめ-",
    "data": [
      101,
      101,
      101,
      101,
      101,
      88,
      101
    ]
  },
  {
    "label": "大盛のぞみでも毎日どうにかやってる。",
    "data": [
      101,
      101,
      101,
      101,
      101,
      101,
      99
    ]
  }
];