var labels = ['2022-06-12','2022-06-13','2022-06-14','2022-06-15','2022-06-16','2022-06-17','2022-06-18',];var datasets = [
  {
    "label": "まめきちまめこニートの日常",
    "data": [
      1,
      1,
      1,
      1,
      1,
      1,
      1
    ]
  },
  {
    "label": "痛いニュース(ﾉ∀`)",
    "data": [
      3,
      4,
      3,
      3,
      2,
      2,
      2
    ]
  },
  {
    "label": "オレ的ゲーム速報＠刃",
    "data": [
      2,
      2,
      2,
      2,
      3,
      4,
      3
    ]
  },
  {
    "label": "不思議.net",
    "data": [
      5,
      3,
      4,
      5,
      4,
      3,
      4
    ]
  },
  {
    "label": "はちま起稿",
    "data": [
      4,
      7,
      5,
      4,
      5,
      6,
      5
    ]
  },
  {
    "label": "暇つぶしニュース",
    "data": [
      6,
      5,
      6,
      6,
      6,
      5,
      6
    ]
  },
  {
    "label": "ハムスター速報",
    "data": [
      11,
      12,
      8,
      7,
      9,
      7,
      7
    ]
  },
  {
    "label": "なんじぇいスタジアム＠なんJまとめ",
    "data": [
      8,
      6,
      7,
      9,
      7,
      9,
      8
    ]
  },
  {
    "label": "NEWSまとめもりー｜2chまとめブログ",
    "data": [
      9,
      9,
      10,
      8,
      8,
      8,
      9
    ]
  },
  {
    "label": "【2ch】ニュー速クオリティ",
    "data": [
      10,
      8,
      9,
      10,
      10,
      10,
      10
    ]
  },
  {
    "label": "カラパイア",
    "data": [
      12,
      10,
      12,
      14,
      19,
      17,
      11
    ]
  },
  {
    "label": "BIPブログ",
    "data": [
      13,
      11,
      11,
      12,
      14,
      11,
      12
    ]
  },
  {
    "label": "哲学ニュースnwk",
    "data": [
      19,
      16,
      13,
      11,
      11,
      14,
      13
    ]
  },
  {
    "label": "ヤゴヴのマンガ劇場",
    "data": [
      14,
      13,
      15,
      13,
      12,
      12,
      14
    ]
  },
  {
    "label": "おうまがタイムズ",
    "data": [
      15,
      14,
      17,
      15,
      13,
      13,
      15
    ]
  },
  {
    "label": "わんこーる速報！",
    "data": [
      18,
      18,
      16,
      16,
      17,
      16,
      16
    ]
  },
  {
    "label": "NEWSぽけまとめーる",
    "data": [
      17,
      19,
      14,
      17,
      20,
      18,
      17
    ]
  },
  {
    "label": "なんJ PRIDE",
    "data": [
      21,
      15,
      19,
      19,
      18,
      21,
      18
    ]
  },
  {
    "label": "あいチャンネル",
    "data": [
      22,
      23,
      29,
      30,
      29,
      32,
      19
    ]
  },
  {
    "label": "VIPPERな俺",
    "data": [
      31,
      27,
      27,
      26,
      22,
      23,
      20
    ]
  },
  {
    "label": "稲妻速報",
    "data": [
      23,
      25,
      23,
      25,
      21,
      20,
      21
    ]
  },
  {
    "label": "カエルDXのオタ活日記",
    "data": [
      20,
      17,
      18,
      20,
      15,
      19,
      22
    ]
  },
  {
    "label": "ぶる速-VIP",
    "data": [
      29,
      22,
      24,
      23,
      25,
      29,
      23
    ]
  },
  {
    "label": "ねいろ速報さん",
    "data": [
      25,
      24,
      20,
      22,
      23,
      22,
      24
    ]
  },
  {
    "label": "なんJクエスト",
    "data": [
      26,
      26,
      25,
      21,
      24,
      28,
      25
    ]
  },
  {
    "label": "ゴールデンタイムズ",
    "data": [
      27,
      29,
      21,
      24,
      26,
      24,
      26
    ]
  },
  {
    "label": "ゆっぺのゆる漫画ブログ",
    "data": [
      101,
      30,
      67,
      37,
      61,
      43,
      27
    ]
  },
  {
    "label": "日刊やきう速報",
    "data": [
      24,
      21,
      22,
      28,
      35,
      31,
      28
    ]
  },
  {
    "label": "うしみつ-5chまとめ-",
    "data": [
      61,
      52,
      51,
      38,
      30,
      33,
      29
    ]
  },
  {
    "label": "ぱんをたずねて2000里ちょい",
    "data": [
      37,
      32,
      33,
      31,
      33,
      26,
      30
    ]
  },
  {
    "label": "カイカイ反応通信",
    "data": [
      32,
      34,
      26,
      29,
      28,
      30,
      31
    ]
  },
  {
    "label": "ラビット速報",
    "data": [
      30,
      28,
      28,
      27,
      27,
      27,
      32
    ]
  },
  {
    "label": "ふくよかまるみのピリカラ人生",
    "data": [
      35,
      33,
      30,
      32,
      36,
      34,
      33
    ]
  },
  {
    "label": "IT速報",
    "data": [
      39,
      39,
      32,
      36,
      37,
      36,
      34
    ]
  },
  {
    "label": "まとめたニュース",
    "data": [
      28,
      37,
      31,
      35,
      32,
      25,
      35
    ]
  },
  {
    "label": "され妻つきこブログ｜アラサーママのサレ妻経験録",
    "data": [
      41,
      48,
      47,
      66,
      86,
      55,
      36
    ]
  },
  {
    "label": "ガールズVIPまとめ",
    "data": [
      42,
      49,
      49,
      63,
      49,
      47,
      37
    ]
  },
  {
    "label": "ネギ速",
    "data": [
      36,
      31,
      35,
      34,
      34,
      35,
      38
    ]
  },
  {
    "label": "ガハろぐNewsヽ(･ω･)/ｽﾞｺｰ",
    "data": [
      44,
      47,
      43,
      39,
      41,
      41,
      39
    ]
  },
  {
    "label": "世にも奇妙ななんかの話",
    "data": [
      16,
      20,
      36,
      18,
      16,
      15,
      40
    ]
  },
  {
    "label": "マンガと私と猫ブログ。",
    "data": [
      63,
      41,
      34,
      59,
      42,
      54,
      41
    ]
  },
  {
    "label": "乃木坂46まとめ 1/46",
    "data": [
      40,
      43,
      38,
      40,
      38,
      40,
      42
    ]
  },
  {
    "label": "おーるじゃんる",
    "data": [
      48,
      46,
      45,
      45,
      43,
      38,
      43
    ]
  },
  {
    "label": "人間まおと愉快な仲間たち",
    "data": [
      84,
      87,
      72,
      90,
      76,
      46,
      44
    ]
  },
  {
    "label": "スカッと連載ブログ（スカログ）",
    "data": [
      101,
      101,
      93,
      86,
      82,
      50,
      45
    ]
  },
  {
    "label": "オタク.com －オタコム－",
    "data": [
      49,
      54,
      39,
      42,
      45,
      44,
      46
    ]
  },
  {
    "label": "ずっと日曜日のターン",
    "data": [
      66,
      50,
      83,
      57,
      60,
      100,
      47
    ]
  },
  {
    "label": "チリツモブログ",
    "data": [
      101,
      101,
      101,
      41,
      101,
      101,
      48
    ]
  },
  {
    "label": "ニュースBUZZ",
    "data": [
      33,
      36,
      40,
      33,
      31,
      39,
      49
    ]
  },
  {
    "label": "VIP NEWS",
    "data": [
      64,
      64,
      46,
      49,
      47,
      42,
      50
    ]
  },
  {
    "label": "えみコミック！",
    "data": [
      47,
      90,
      50,
      94,
      50,
      85,
      51
    ]
  },
  {
    "label": "【2ch】コピペ情報局",
    "data": [
      38,
      42,
      44,
      47,
      40,
      37,
      52
    ]
  },
  {
    "label": "MLB NEWS@まとめ",
    "data": [
      46,
      57,
      60,
      61,
      53,
      52,
      53
    ]
  },
  {
    "label": "オタクニュース",
    "data": [
      89,
      70,
      63,
      64,
      44,
      59,
      54
    ]
  },
  {
    "label": "気になる芸能まとめ",
    "data": [
      34,
      38,
      42,
      43,
      46,
      48,
      55
    ]
  },
  {
    "label": "web漫画家やしろあずきの日常",
    "data": [
      57,
      55,
      58,
      74,
      101,
      49,
      56
    ]
  },
  {
    "label": "芸能人の気になる噂",
    "data": [
      60,
      62,
      56,
      50,
      55,
      61,
      57
    ]
  },
  {
    "label": "馬鳥速報",
    "data": [
      77,
      77,
      52,
      68,
      69,
      62,
      58
    ]
  },
  {
    "label": "ポリー速報",
    "data": [
      43,
      44,
      37,
      46,
      54,
      57,
      59
    ]
  },
  {
    "label": "カオスちゃんねる",
    "data": [
      52,
      76,
      41,
      44,
      39,
      45,
      60
    ]
  },
  {
    "label": "凹凸ちゃんねる　発達障害・生きにくい人のまとめ",
    "data": [
      70,
      72,
      90,
      80,
      73,
      65,
      61
    ]
  },
  {
    "label": "海外の万国反応記＠海外の反応",
    "data": [
      71,
      56,
      48,
      51,
      57,
      56,
      62
    ]
  },
  {
    "label": "PS5速報！",
    "data": [
      75,
      89,
      84,
      56,
      90,
      98,
      63
    ]
  },
  {
    "label": "コミックエッセイ えむふじんがあらわれた",
    "data": [
      59,
      65,
      55,
      55,
      58,
      66,
      64
    ]
  },
  {
    "label": "スターライト速報 -遊戯王OCG情報まとめ-",
    "data": [
      62,
      58,
      59,
      58,
      62,
      64,
      65
    ]
  },
  {
    "label": "Jの番記者",
    "data": [
      101,
      101,
      101,
      101,
      101,
      101,
      66
    ]
  },
  {
    "label": "ダイエット速報＠2ちゃんねる",
    "data": [
      80,
      61,
      70,
      101,
      95,
      73,
      67
    ]
  },
  {
    "label": "ふぇー速",
    "data": [
      78,
      35,
      65,
      62,
      74,
      63,
      68
    ]
  },
  {
    "label": "サカラボ | サッカーまとめ速報",
    "data": [
      51,
      59,
      54,
      48,
      51,
      67,
      69
    ]
  },
  {
    "label": "エクサワロス",
    "data": [
      68,
      51,
      61,
      70,
      66,
      74,
      70
    ]
  },
  {
    "label": "ライフハックちゃんねる弐式",
    "data": [
      54,
      69,
      81,
      54,
      59,
      51,
      71
    ]
  },
  {
    "label": "なんJ（まとめては）いかんのか？",
    "data": [
      50,
      45,
      78,
      77,
      84,
      82,
      72
    ]
  },
  {
    "label": "流速VIP",
    "data": [
      69,
      71,
      66,
      72,
      68,
      71,
      73
    ]
  },
  {
    "label": "2chコピペ保存道場",
    "data": [
      88,
      78,
      62,
      75,
      71,
      72,
      74
    ]
  },
  {
    "label": "修羅場ハザード -復讐・DQN返し・衝撃系まとめ-",
    "data": [
      73,
      79,
      85,
      69,
      64,
      70,
      75
    ]
  },
  {
    "label": "軍事・ミリタリー速報☆彡",
    "data": [
      72,
      73,
      76,
      71,
      63,
      68,
      76
    ]
  },
  {
    "label": "ツバメ速報＠ヤクルトスワローズまとめ",
    "data": [
      67,
      66,
      53,
      60,
      52,
      53,
      77
    ]
  },
  {
    "label": "あにこ便",
    "data": [
      56,
      53,
      57,
      65,
      70,
      75,
      78
    ]
  },
  {
    "label": "ついんてーる速報",
    "data": [
      53,
      74,
      68,
      76,
      65,
      58,
      79
    ]
  },
  {
    "label": "かぞくちゃんねる",
    "data": [
      98,
      81,
      73,
      79,
      77,
      83,
      80
    ]
  },
  {
    "label": "ろくのコミックブログ",
    "data": [
      91,
      101,
      75,
      101,
      83,
      101,
      81
    ]
  },
  {
    "label": "はーとログ",
    "data": [
      87,
      75,
      74,
      73,
      67,
      76,
      82
    ]
  },
  {
    "label": "thunthunのドタバタ起笑転結",
    "data": [
      101,
      101,
      101,
      101,
      101,
      69,
      83
    ]
  },
  {
    "label": "鷹速@ホークスまとめブログ",
    "data": [
      76,
      68,
      71,
      53,
      89,
      87,
      84
    ]
  },
  {
    "label": "なんJ　高校野球まとめ速報",
    "data": [
      65,
      67,
      91,
      81,
      93,
      81,
      85
    ]
  },
  {
    "label": "De速",
    "data": [
      55,
      63,
      86,
      52,
      56,
      80,
      86
    ]
  },
  {
    "label": "今日もブブはからまわり。",
    "data": [
      101,
      101,
      101,
      101,
      85,
      95,
      87
    ]
  },
  {
    "label": "ろぼ速VIP",
    "data": [
      85,
      95,
      100,
      95,
      92,
      93,
      88
    ]
  },
  {
    "label": "しろやぎの漫画おおめブログ",
    "data": [
      101,
      101,
      101,
      101,
      101,
      101,
      89
    ]
  },
  {
    "label": "お料理速報",
    "data": [
      96,
      86,
      89,
      83,
      91,
      96,
      90
    ]
  },
  {
    "label": "カータンBLOG　あたし・主婦の頭の中",
    "data": [
      101,
      88,
      64,
      67,
      80,
      79,
      91
    ]
  },
  {
    "label": "にいがた通信 - 新潟県新潟市の地域情報サイト",
    "data": [
      101,
      99,
      101,
      101,
      101,
      92,
      92
    ]
  },
  {
    "label": "やみ速@なんJ西武まとめ",
    "data": [
      95,
      94,
      101,
      97,
      101,
      101,
      93
    ]
  },
  {
    "label": "一人暮らしカマタミワの半径3メートルのカオス",
    "data": [
      81,
      101,
      101,
      98,
      79,
      60,
      94
    ]
  },
  {
    "label": "〜うちのヒフミヨ！４人育児はエンターテインメント〜",
    "data": [
      101,
      101,
      101,
      101,
      97,
      101,
      95
    ]
  },
  {
    "label": "投資ちゃんねる",
    "data": [
      83,
      85,
      82,
      85,
      87,
      88,
      96
    ]
  },
  {
    "label": "怒り新党～仕返し・復讐・修羅場まとめ～",
    "data": [
      97,
      92,
      101,
      93,
      98,
      90,
      97
    ]
  },
  {
    "label": "FF14速報",
    "data": [
      82,
      101,
      92,
      82,
      96,
      84,
      98
    ]
  },
  {
    "label": "アニはつ -アニメ発信場-",
    "data": [
      79,
      84,
      80,
      92,
      81,
      94,
      99
    ]
  },
  {
    "label": "ツイッター速報",
    "data": [
      101,
      101,
      101,
      101,
      101,
      101,
      100
    ]
  }
];